# Brew taps
tap 'homebrew/cask'
tap 'AdoptOpenJDK/openjdk'
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'
tap 'd12frosted/emacs-plus'

# Standard brew install
brew 'curl'
brew 'openssl'
brew 'readline'
brew 'gcc'
brew 'git'
brew 'automake'
brew 'pkg-config'
brew 'tree-sitter'
brew 'luajit'
brew 'neovim'
brew 'gpg2'
brew 'coreutils'
brew 'fish'
brew 'fzf'
brew 'go'
brew 'jq'
brew 'zlib'
brew 'cmake'
brew 'pngpaste'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'direnv'
brew 'tmux'
brew 'starship'
brew 'editorconfig'
brew 'clang-format'
brew 'glslang'
brew 'pandoc'
brew 'graphviz'
brew 'shellcheck'
brew 'stylelint'
brew 'zig'
brew 'zls'
brew 'git-delta'
brew 'borkdude/brew/clj-kondo'
brew 'emacs-plus', args: ["with-ctags", "with-dbus", "with-mailutils", "with-xwidgets", "with-imagemagick", "with-native-comp"]

# cask installs
cask '1password'
cask 'iterm2'
cask 'discord'
cask 'slack'
cask 'rectangle'
cask 'iina'
cask 'visual-studio-code'
cask 'raycast'
cask 'bitwarden'
cask 'firefox'
cask 'spotify'
cask 'yubico-authenticator'

# mac app stores
mas 'Tailscale', id: 1475387142
mas 'NextDNS', id: 1464122853
mas 'NepTunes', id: 1006739057

# font stuff
cask 'font-juliamono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-0xproto-nerd-font'
cask 'font-ibm-plex-mono'
