# Brew taps
tap 'homebrew/cask'
tap 'railwaycat/emacsmacport'
tap 'borkdude/brew'

# Standard brew install
brew 'automake'
brew 'pkg-config'
brew 'tree-sitter'
brew 'luajit', args: ['HEAD']
brew 'neovim', args: ['HEAD']
brew 'mas'
brew 'gpg2'
brew 'starship'
brew 'coreutils'
brew 'zsh'
brew 'fzf'
brew 'go'
brew 'ripgrep'
brew 'exa'
brew 'fd'
brew 'lsd'
brew 'xsv'
brew 'node'
brew 'python'
brew 'python3'
brew 'clojure'
brew 'leiningen'
brew 'clj-kondo'
brew 'rbenv'
brew 'cmake'
brew 'pngpaste'
brew 'bat'

# cask installs
cask 'google-chrome'
cask 'spotify'
cask 'iterm2'
cask 'discord'
cask 'slack'
cask 'emacs-mac'
cask 'rectangle'
cask 'hey'
cask 'iina'
cask 'cloudapp'
cask 'visual-studio-code'
cask 'adoptopenjdk'
cask 'mactex'
cask 'alacritty'

# mas installs
mas 'NextDNS', id: 1_464_122_853
mas 'Sorted³ - Calendar Notes Tasks', id: 1_306_893_526
mas 'Xcode', id: 497_799_835
mas 'Tailscale', id: 1_475_387_142
mas 'Bitwarden', id: 1_352_778_147
