tap "homebrew/cask"
tap "railwaycat/emacsmacport"

# Standard brew install
brew "neovim"
brew "mas"
brew "gpg2"
brew "starship"
brew "coreutils"
brew "zsh"
brew "fzf"
brew "go"
brew "ripgrep"
brew "exa"
brew "fd"
brew "lsd"
brew "xsv"
brew "node"
brew "python"

# cask installs
cask "google-chrome"
cask "spotify"
cask "iterm2"
cask "discord"
cask "slack"
cask "bitwarden"
cask "emacs-mac"

# mas installs
mas "NextDNS", id: 1464122853
mas "Sorted³ - Calendar Notes Tasks", id: 1306893526
# mas "Xcode", id: 497799835
